---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.DuctPressureDropService
source: html/81dd634f-cd45-bb04-4854-daff8ed7777a.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.DuctPressureDropService Property

The external service which permits registration of an alternate implementation for duct pressure drop calculation.
 To use this service, programmers implement a server class that derives from IDuctPressureDropServer .

## Syntax (C#)
```csharp
public static ExternalServiceId DuctPressureDropService { get; }
```